[
    {
        "date": "2014-06-15T17:24:46.000Z",
        "id": 0,
        "title": "Este post tem como objetivo ser um post inútil.",
        "content": "Este é um post teste. Esse blog precisa de um pouco mais de amor com css. Talvez umas animações nesse ng-repeat dos posts."
    },
    {
        "date": "2014-06-15T17:50:30.000Z",
        "id": 1,
        "title": "Está no ar!",
        "content": "Agora é só tomar cuidado para não estourar a cota de 100MB do Firebase. Acho que o próximo passo é fazer uma interface para publicar os posts. Bem, isso fica para outro dia. Por enquanto estou contente com isso."
    },
    {
        "date": "2014-06-15T17:57:00.000z",
        "id": 2,
        "title": "Aviso <i class=\"fa fa-exclamation-circle\"></i>",
        "content": "Se este post for o primeiro post da página isso quer dizer que este blog ainda está sob construção. Qualquer contribuição é bem vinda. Dê uma olhada no repositório do github. <br/> Próximos passos: <ul> <li>Interface para criar posts</li> <li>Melhorar css</li> <li>Link nos posts para mais detalhes</li> <li>Animação no ng-repeat dos posts</li> <li>Comentários? (provavelmente Disqus, não quero fazer isso na mão)</li> <li>RSS?</li> <li>Tirar posts do Firebase e usar um arquivo json local.</li> </ul>"
    },
    {
        "content": "<p>Ainda há muito o que fazer. No momento eu tirei poucas coisas da lista feita no meu último post. <br/>\nAgora há uma página para criar os posts e eu larguei o Firebase. Mas não há autenticação então, mesmo que eu deixe permissões apenas de leitura no .json, qualquer um que acho o link pode entrar e criar posts.<br/>\nIsto é um problema.</p>\n<p>Vou largar a ideia de comentários. Eu sei que isso aqui vai ficar alheio ao mundo externo. Também vou largar RSS. Muito empenho fazer um e usar algo pronto não justifica o fato que não haverão inscritos.</p>\n<p>Simples assim e eu já tirei quatro coisas da lista.</p>\n<p>Mas vou adicionar mais algumas coisas.  Estou escrevendo os posts com HTML (o que me permite jogar umas classes css bacanas nos posts <i class=\"fa fa-code\"></i>), mas quero passar a usar markdown. Vi um projeto de um editor de <a href=\"http://jbt.github.io/markdown-editor/#bVPLbtswELzzK7ZwANmtLfWcntqkaQMkQNHHKSgQWqQkWiJXIFdWkqL/3l0qcHoIYIIGOZzZ2VmtYP3F0ddpv7sa9BGjNRu41bE3OAf4bBxhVOqTTq6GKdlmGqCxmqZoYXCJzpWCt3BBcaguvIF38AMIIemjBeosNG6wAriMugUdDJiII+h8Di4wtLPMxPuA2oAjAV/JZY2BbKAEmu+Fj29D5vz1/QYSwiNOUOsAqROEECal1HXhISC0iAY0wRwdudAygR+ZtBLcYCOQfaCtsLSYMSyB3lInWCaOyQ5NqdQNYr/lcsXpm+y0QZRtr+OyPSn1kW2JiyJlEq7cWAbf398f9FGnOrqR1Nm6mUJNDsN680cBnK0L447FpuzID+viGrRnHT4qi80H9ZcXv1fqZ+cS8O8OAywp/V53RGM6r6rWUTftyxp9ddhT5Z8z29mc2UbcDZaAK+oDzuAauC44lv372EszKVc7S+XsVH3jYJIEcRtLuETc57hE/k4MwcK6qLO4j4YxWXyMeLA1pUpwz+rVZgtNRA9z5+pOSWwupNFFLS0QGe512maN3LSO/z2Ck5Q8x77AOA5iUK29lLhareAHTU0jc2iEw+veZqJlCu+kBda82qG6Oxw2nF58me1Rx8R555cXXPqti/E/h+LG56MyWKqWx2JEzzaXnB65zodd59pu4EVc02I+M56Oy0M6cSZsaOZx9To4XacSY5vPqhO6suFZaqGH042MJn8BONE4UR4y2A9Y9ynLHdLO2GbQZF+1b3TosdWuesEtKu2TG0ehxgaMJn1qK89Hw4sV+XtL6h8=\" target=\"_blank\">git flavored markdown</a> e de uma <a href=\"https://github.com/btford/angular-markdown-directive\" target=\"_blank\">diretriz do Angular.JS</a> para converter (ou seria compilar? Vi isso num projeto por aí, bateu a dúvida) markdown para HTML. Talvez eu faça a minha própria diretriz me aproveitando do git flavored markdown. Gosto mais do que markdown puro.</p>\n\n<p>Penso em fazer algo no \"criador de posts\" pra escrever ou em HTML ou markdown e ele saber qual é.  Talvez eu acabe fazendo (mais  provavelmente usando) um linter HTML no editor.</p>\n\n<p>Acho que vou acabar mudando o título para \"aceitar\" HTML também.</p>",
        "title": "TO DO",
        "date": "2014-07-11T22:41:58.280Z",
        "id": "2014-07-11T22:41:58.280Z"
    }
]

